Repository: endlessm/godot-block-coding
Catalog: addons/block_code/locale/*.po
Languages: de, es, fr, pl

source: Regenerate %s POT file
de: %s POT-Datei regenerieren
es: Regenera %s archivo POT
fr: Regénérer le fichier POT %s
pl: Regeneruj plik POT %s

source: Update %s translated files
de: %s übersetzte Dateien aktualisieren
es: Actualiza %s archivos traducidos
fr: Mettre à jour les fichiers traduits %s
pl: Aktualizuj pliki tłumaczenia %s

source: Communication | Groups
de: Kommunikation | Gruppen
es: Comunicación | Grupos
fr: Communication | Groupes
pl: Komunikacja | Grupy

source: Add the node into the group
de: Knoten zur Gruppe hinzufügen
es: Agrega el nodo al grupo.
fr: Ajouter le nœud au groupe
pl: Dodaj węzeł do grupy

source: add {node: OBJECT} to group {group: STRING}
de: Füge {node: OBJECT} der Gruppe {group: STRING} hinzu
es: agregar {node: OBJECT} al grupo {group: STRING}
fr: ajouter {node: OBJECT} au groupe {group: STRING}
pl: dodaj {node: OBJECT} do grupy {group: STRING}

source: Add this node into the group
de: Diesen Knoten zur Gruppe hinzufügen
es: Agrega este nodo al grupo.
fr: Ajouter ce nœud au groupe
pl: Dodaj ten węzeł do grupy

source: add to group {group: STRING}
de: Hinzufügen zu Gruppe {group: STRING}
es: agregar al grupo {group: STRING}
fr: ajouter au groupe {group: STRING}
pl: dodaj do grupy {group: STRING}

source: Communication | Methods
de: Kommunikation | Methoden
es: Comunicación | Métodos
fr: Communication | Méthodes
pl: Komunikacja | Metody

source: when this node collides with [something: OBJECT]
de: Wenn dieser Node kollidiert mit [something: OBJECT]
es: cuando este nodo colisiona con [something: OBJECT]
fr: quand ce nœud entre en collision avec [quelque chose: OBJECT]
pl: kiedy ten węzeł kolizuje z [something: OBJECT]

source: when this node stops colliding with [something: OBJECT]
de: Wenn dieser Node nicht mehr kollidiert mit [something: OBJECT]
es: cuando este nodo deja de colisionar con [something: OBJECT]
fr: quand ce nœud arrête d'être en collision avec [quelque chose: OBJECT]
pl: kiedy ten węzeł przestaje kolidować z [something: OBJECT]

source: Calls the method/function on each member of the given group
de: Ausführen der Funktion für jedes Mitglied der gegebenen Gruppe
es: Llama al método/función en cada miembro del grupo proporcionado.
fr: Appelle la méthode/fonction sur chaque membre du groupe donné
pl: Woła metodę/funkcję na każdym członku danej grupy

source: call method {method_name: STRING} in group {group: STRING}
de: Aufruf Methode {method_name: STRING} in Gruppe {group: STRING}
es: llamar al método {method_name: STRING} en el grupo {group: STRING}
fr: appeler la méthode {method_name: STRING} dans le groupe {group: STRING}
pl: wywołaj metodę {method_name: STRING} w grupie{group: STRING}

source: Calls the method/function of the given node
de: Aufruf der Funktion des Nodes
es: Llama al método/función en el nodo proporcionado.
fr: Appelle la méthode/fonction du nœud donné
pl: Woła metodę/funkcję danego węzła

source: call method {method_name: STRING} on node {node: OBJECT}
de: Aufruf Methode {method_name: STRING}für Node {node: OBJECT}
es: llamar al método {method_name: STRING} en el nodo {node: OBJECT}
fr: appeler la méthode {method_name: STRING} sur le nœud {node: OBJECT}
pl: wywołaj metodę {method_name: STRING} w węźle {node: OBJECT}

source: Define a method/function with following statements
de: Definiere eine Funktion mit folgenden Anweisungen
es: Define un método/función con las declaraciones siguientes.
fr: Définir une méthode/fonction avec les instructions suivantes
pl: Definiuj metodę/funkcję z następującymi wyrażeniami

source: define method {method_name: STRING_NAME}
de: Definiere Methode {method_name: STRING_NAME}
es: definir método {method_name: STRING_NAME}
fr: définir la méthode {method_name: STRING_NAME}
pl: zdefiniuj metodę {method_name: STRING_NAME}

source: Communication | Nodes
de: Kommunikation | Knoten
es: Comunicación | Nodos
fr: Communication | Nœuds
pl: Komunikacja | Węzły

source: Get the node at the given path
de: Hole den Node über den angegebenen Pfad
es: Obtiene el nodo en la ruta proporcionada.
fr: Obtenir le nœud au chemin donné
pl: Pobierz węzeł w danej ścieżce

source: {path: NIL}
fr: {chemin: NIL}

source: Is this node in the group
de: Ist dieser Knoten in der Gruppe
es: Verdadero si este nodo pertenece al grupo proporcionado.
fr: Est-ce que ce nœud est dans le groupe
pl: Czy ten węzeł jest w grupie

source: is in group {group: STRING}
de: ist in Gruppe {group: STRING}
es: está en el grupo {group: STRING}
fr: est dans le groupe {group: STRING}
pl: jest w grupie {group: STRING}

source: Is the node in the group
de: Ist der Knoten in der Gruppe
es: Verdadero si el nodo pertenece al grupo proporcionado.
fr: Est-ce que le nœud est dans le groupe
pl: Czy węzeł jest w grupie

source: {node: OBJECT} is in group {group: STRING}
de: {node: OBJECT} ist in Gruppe {group: STRING}
es: {node: OBJECT} está en el grupo {group: STRING}
fr: {node: OBJECT} est dans le groupe {group: STRING}
pl: {node: OBJECT} jest w grupie {group: STRING}

source: Remove this node from the group
de: Diesen Knoten aus der Gruppe entfernen
es: Quita a este nodo del grupo.
fr: Retirer ce nœud du groupe
pl: Usuń ten węzeł z grupy

source: remove from group {group: STRING}
de: aus Gruppe entfernen {group: STRING}
es: quitar del grupo {group: STRING}
fr: retirer du groupe {group: STRING}
pl: usuń z grupy {group: STRING}

source: Remove the node from the group
de: Knoten aus der Gruppe entfernen
es: Quita el nodo del grupo.
fr: Retirer le nœud du groupe
pl: Usuń węzeł z grupy

source: remove {node: OBJECT} from group {group: NIL}
de: Entferne {node: OBJECT}aus Gruppe {group: NIL}
es: quitar {node: OBJECT} del grupo {group: NIL}
fr: retirer {node: OBJECT} du groupe {group: NIL}
pl: usuń {node: OBJECT} z grupy {group: NIL}

source: Graphics | Animation
de: Grafik | Animation
es: Gráficos | Animación
fr: Graphismes | Animation
pl: Grafika | Animacja

source: Check if an animation is currently playing.
de: Prüft on gerade eine Animation abgespielt wird.
es: Chequea si la animación se está reproduciendo.
fr: Vérifier si une animation est en cours de lecture.
pl: Sprawdź czy animacja aktualnie się odtwarza.

source: is playing
de: wird abgespielt
es: se está reproduciendo
fr: est en lecture
pl: jest odtwarzana

source: Pause the currently playing animation.
de: Pausiert die momentan abgespielte Animation
es: Pausa la animación que se está reproduciendo.
fr: Mettre en pause l'animation en cours.
pl: Zapauzuj aktualnie odtwarzaną animację.

source: pause
es: pausar
fr: mettre en pause
pl: pauzuj

source: Play the animation.
de: Die Animation abspielen.
es: Reproduce la animación.
fr: Lire l'animation.
pl: Odtwórz animację.

source: play {animation: STRING} | {direction: NIL} {wait_mode: NIL}
de: Spiele {animation: STRING} | {direction: NIL} {wait_mode: NIL}
es: reproducir {animation: STRING} | {direction: NIL} {wait_mode: NIL}
fr: lire {animation: STRING} | {direction: NIL} {wait_mode: NIL}
pl: odtwórz {animation: STRING} | {direction: NIL} {wait_mode: NIL}

source: Stop the currently playing animation.
de: Stoppe die momentan abgespielte Animation.
es: Detiene la animación que se está reproduciendo.
fr: Arrêter l'animation en cours.
pl: Zatrzymaj aktualnie odtwarzaną animację.

source: stop
es: detener
fr: arrêter
pl: zatrzymaj

source: Graphics | Viewport
de: Grafik | Ansichtsfenster
es: Gráficos | Vista
fr: Graphismes | Vue
pl: Grafika | Rzutnia

source: Coordinates of the middle of the viewable screen when playing.
de: Koordinaten der Mitte des sichtbaren Bildschirms beim Spielen.
es: Las coordenadas al centro de la vista del juego cuando este está corriendo.
fr: Coordonnées du centre de l'écran visible pendant le jeu.
pl: Koodrynuje ścrodek widocznego ekranu podczas grania.

source: viewport center
de: Ansichtsfenstermitte
es: centro de la vista
fr: centre de la vue
pl: środek rzutni

source: How tall the viewable screen is when playing.
de: Wie hoch der sichtbare Bildschirm beim Spielen ist.
es: La altura de la vista del juego cuando este está corriendo.
fr: Hauteur de l'écran visible pendant le jeu.
pl: Jak wysoki jest widoczny ekran podczas grania.

source: viewport height
de: Ansichtsfensterhöhe
es: altura de la vista
fr: hauteur de la vue
pl: wysokość rzutni

source: How wide the viewable screen is when playing.
de: Wie breit der sichtbare Bildschirm beim Spielen ist.
es: El ancho de la vista del juego cuando este está corriendo.
fr: Largeur de l'écran visible pendant le jeu.
pl: Jak szeroki jest widoczny ekran podczas grania.

source: viewport width
de: Ansichtsfensterbreite
es: ancho de la vista
fr: largeur de la vue
pl: szerokość rzutni

source: Physics | Velocity
de: Physik | Geschwindigkeit
es: Física | Velocidad
fr: Physique | Vitesse
pl: Fizyka | Prędkość

source: True if the character is on the floor.
de: Wahr, wenn die Figur auf dem Boden ist.
es: Verdadero si el personaje está en el suelo.
fr: Vrai si le personnage est sur le sol.
pl: Prawda, jeśli postać jest na podłodze.

source: is on floor
de: ist auf dem Boden
es: está en el suelo
fr: est sur le sol
pl: jest na podłodze

source: Input
de: Eingabe
es: Entrada
fr: Entrée
pl: Sterowanie

source: Move the character up, down, left, and right with the keyboard using the given keys. The speed of movement can be adjusted separately for x (left and right) and y (up and down).
de: Bewege die Figur rauf, runter, links und rechts mit der Tastatur und den angegenenen Tasten. Die Geschwindigkeit kann separat eingestellt werden für x (links und rechts) und y (rauf und runter).
es: Mueve al personaje hacia arriba, abajo, izquierda y derecha con el teclado usando las teclas proporcionadas. La velocidad del movimiento puede ser ajustado por separado para X (izquierda y derecha) como para Y (arriba y abajo).
fr: Déplacer le personnage vers le haut, le bas, la gauche et la droite avec le clavier en utilisant les touches données. La vitesse de déplacement peut être ajustée séparément pour x (gauche et droite) et y (haut et bas).
pl: Porusz postacią w górę, dół, lewo i prawo za pomocą klawiatury, używając danych klawiszy. Szybkość poruszania może być dopasowana oddzielnie dla x (lewo i prawo) oraz y (góra i dół).

source: move with keys {up: STRING} {down: STRING} {left: STRING} {right: STRING} at speed {speed: VECTOR2}
de: Bewegen mit den Tasten {up: STRING} {down: STRING} {left: STRING} {right: STRING} mit Geschwindigkeit {speed: VECTOR2}
es: mover con teclas {up: STRING} {down: STRING} {left: STRING} {right: STRING} a velocidad {speed: VECTOR2}
fr: déplacer avec les touches {up: STRING} {down: STRING} {left: STRING} {right: STRING} à la vitesse {speed: VECTOR2}
pl: poruszaj się klawiszami {up: STRING} {down: STRING} {left: STRING} {right: STRING} z szybkością {speed: VECTOR2}

source: True if the specified input action has been pressed or released.
de: Wahr falls die angegebene Eingabeaktion gedrückt oder losgelassen wurde.
es: Verdadero si la acción de entrada especificada ha sido apretada o soltada.
fr: Vrai si l'action d'entrée spécifiée a été pressée ou relâchée.
pl: Prawda, jeśli podana akcja została wciśnięta lub puszczona.

source: action {action_name: STRING_NAME} is {action: NIL}
de: Aktion {action_name: STRING_NAME} ist {action: NIL}
es: acción {action_name: STRING_NAME} está {action: NIL}
fr: l'action {action_name: STRING_NAME} est {action: NIL}
pl: akcja {action_name: STRING_NAME} jest {action: NIL}

source: Lifecycle
de: Lebenszyklus
es: Ciclo de vida
fr: Cycle de vie
pl: Cykl działania

source: Attached blocks will be executed during the processing step of the main loop
de: Angefügte Blocks werden ausgeführt während des Processing-Schritts der Hauptschleife.
es: Los bloques conectados serán ejecutados durante el paso de procesamiento del bucle principal.
fr: Les blocs attachés seront exécutés pendant l'étape de traitement de la boucle principale
pl: Dołączone bloki będą wykonywane podczas kroku przetwarzania pętli głównej

source: every frame
de: jeden Frame
es: en cada fotograma
fr: à chaque image
pl: każda klatka

source: Queues this node to be deleted at the end of the current frame
de: Löscht diesen Node nach dem momentanten Frame.
es: Hace que este nodo sea borrado al final del fotograma actual.
fr: Met ce nœud en file d'attente pour être supprimé à la fin de l'image actuelle
pl: Kolejkuje usunięcie tego węzła na końcu aktualnej klatki

source: remove
de: entfernen
es: quitar
fr: supprimer
pl: usuń

source: Queues the given node to be deleted at the end of the current frame
de: Löscht den angegebenen Node nach dem momentanen Frame.
es: Hace que el nodo proporcionado sea borrado al final del fotograma actual.
fr: Met le nœud donné en file d'attente pour être supprimé à la fin de l'image actuelle
pl: Kolejkuje usunięcie podanego węzła na końcu aktualnej klatki

source: remove {node: OBJECT}
de: entfernen {node: OBJECT}
es: quitar {node: OBJECT}
fr: supprimer {node: OBJECT}
pl: usuń {node: OBJECT}

source: Attached blocks will be executed once when the node is "ready"
de: Angefügte Blücke werden ausgeführt, sobald der Node "ready" ist.
es: Los bloques conectados serán ejecutados una vez que el nodo esté "listo".
fr: Les blocs attachés seront exécutés une fois que le nœud est « prêt »
pl: Dołączone bloki będą wykonane raz, kiedy węzeł jest "gotowy"

source: when starting
de: Beim Start
es: al empezar
fr: au démarrage
pl: na początku

source: Log
de: Protokoll
es: Registro
fr: Journal
pl: Dziennik

source: Pause execution and show the current line of code in the debugger.
de: Ausführung pausieren und die aktuelle Codezeile im Debugger anzeigen.
es: Pausa la ejecución y muestra la línea de código actual en el depurador.
fr: Mettre en pause l'exécution et afficher la ligne de code actuelle dans le débogueur.
pl: Zapauzuj wykonywanie i pokaż aktualną linijkę kodu w debugerze

source: breakpoint
de: Haltepunkt
es: punto de interrupción
fr: point d'arrêt
pl: punkt wstrzymania

source: {string1: STRING} + {string2: STRING}
fr: {chaîne1: STRING} + {chaîne2: STRING}

source: Print the text to output
de: Den Text ausgeben
es: Imprime el texto a la salida.
fr: Afficher le texte dans la sortie
pl: Wypisz tekst do konsoli

source: log text {text: STRING}
de: Text loggen: {text: STRING}
es: registrar texto {text: STRING}
fr: afficher le texte {text: STRING}
pl: wypisz tekst {text: STRING}

source: Logic | Boolean
de: Aussagenlogik | Boolean
es: Lógica | Booleanos
fr: Logique | Booléen
pl: Logika | Prawda/Fałsz

source: {bool1: BOOL} and {bool2: BOOL}
de: {bool1: BOOL} und {bool2: BOOL}
es: {bool1: BOOL} y {bool2: BOOL}
fr: {bool1: BOOL} et {bool2: BOOL}
pl: {bool1: BOOL} oraz {bool2: BOOL}

source: Logic | Comparison
de: Logik | Vergleich
es: Lógica | Comparación
fr: Logique | Comparaison
pl: Logika | Porównanie

source: {float1: FLOAT} {op: NIL} {float2: FLOAT}
fr: {flottant1: FLOAT} {op: NIL} {flottant2: FLOAT}

source: Logic | Conditionals
de: Logik | Konditionale
es: Lógica | Condicionales
fr: Logique | Conditionnels
pl: Logika | Warunki

source: else
de: sonst
es: si no
fr: sinon
pl: inaczej

source: else if {condition: BOOL}
de: sonst falls {condition: BOOL}
es: si no, si {condition: BOOL}
fr: sinon si {condition: BOOL}
pl: inaczej jeśli {condition: BOOL}

source: if {condition: BOOL}
de: falls {condition: BOOL}
es: si {condition: BOOL}
fr: si {condition: BOOL}
pl: jeśli {condition: BOOL}

source: not {bool: BOOL}
de: nicht {bool: BOOL}
es: no {bool: BOOL}
fr: non {bool: BOOL}
pl: nie{bool: BOOL}

source: {bool1: BOOL} or {bool2: BOOL}
de: {bool1: BOOL} oder {bool2: BOOL}
es: {bool1: BOOL} o {bool2: BOOL}
fr: {bool1: BOOL} ou {bool2: BOOL}
pl: {bool1: BOOL} lub {bool2: BOOL}

source: Loops
de: Schleifen
es: Bucles
fr: Boucles
pl: Pętle

source: wait for the scene to be ready
de: Warten bis die Szene bereit ist
es: esperar a que la escena esté lista
fr: attendre que la scène soit prête
pl: czekaj, aż scena będzie gotowa

source: break
de: unterbrechen
es: interrumpir
fr: arrêter la boucle
pl: przerwij

source: continue
de: fortsetzen
es: continuar
fr: continuer
pl: kontynuuj

source: Run the connected blocks [i]number[/i] times
de: Wiederhole die verbundenen Blöcke [i]Anzahl[/i]mal
es: Corre los bloques conectados un número [i]number[/i] de veces.
fr: Exécuter les blocs connectés [i]nombre[/i] de fois
pl: Uruchom połączone bloki [i]ilośc[/i] razy

source: repeat {number: INT}
de: wiederhole {number: INT}
es: repetir {number: INT}
fr: répéter {number: INT}
pl: powtórz {number: INT}

source: Run the connected blocks as long as [i]condition[/i] is true. Hint: snap a [b]Comparison[/b] block into the condition.
de: Wiederhole die verbundenen Blöcke solange [i]Bedingung[/i]wahr ist. Hinweis: Füge einen [b]Vergleich[/b] Block in die Bedingung ein.
es: Corre los bloques conectados mientras la condición [i]condition[/i] sea cierta. Hint: encaja un bloque de [b]Comparación[/b] dentro de la condición.
fr: Exécuter les blocs connectés tant que la [i]condition[/i] est vraie. Conseil : attachez un bloc de [b]Comparaison[/b] à la condition.
pl: Uruchom połaczone bloki dopóki [i]warunek[/i] jest prawdziwy. Wskazówka: wrzuć blok [b]Porównania[/b] w warunek.

source: while {condition: BOOL}
de: solange {condition: BOOL}
es: mientras {condition: BOOL}
fr: tant que {condition: BOOL}
pl: dopóki {condition: BOOL}

source: Math
de: Mathe
es: Matemáticas
fr: Mathématiques
pl: Matematyka

source: Calculate the cosine of [i]angle[/i]
de: Berechne den Kosinus von [i]Winkel [/i]
es: Calcula el coseno del [i]angle[/i]
fr: Calculer le cosinus de [i]l'angle[/i]
pl: Policz kosinus [i]kąta[/i]

source: Generate a random floating point number between [i]from[/i] and [i]to[/i] inclusively
de: Erzeugt eine zufällige Gleitkommazahl zwischen [i]von[/i] und [i]bis[/i](einschließlich)
es: Genera un número aleatorio de punto flotante entre [i]from[/i] y [i]to[/i], inclusive.
fr: Générer un nombre à virgule flottante aléatoire entre [i]de[/i] et [i]à[/i] inclusivement
pl: Generuj losową zmiennoprzecinkową liczbę pomiędzy [i]od[/i], a [i]do[/i], włącznie.

source: random floating point number between {from: FLOAT} and {to: FLOAT}
de: zufällige Gleitkommazahl zwischen {from: FLOAT}und {to: FLOAT}
es: número de punto flotante aleatorio entre {from: FLOAT} y {to: FLOAT}
fr: nombre à virgule flottante aléatoire entre {from: FLOAT} et {to: FLOAT}
pl: losowa zmiennoprzecinkowa licza pomiędzy {from: FLOAT} i {to: FLOAT}

source: Generate a random signed 32-bits integer number between [i]from[/i] and [i]to[/i] inclusively. [i]from[/i] and [i]to[/i] can be a negative or positive number
de: Erzeugt eine zufällige 32-Bit-Ganzzahl mit Vorzeichen zwischen [i]von[/i] und [i]bis[/i] einschließlich. [i]von[/i] und [i]bis[/i] können negative oder positive Ganzzahlen sein.
es: Genera un número entero de 32-bits entre [i]from[/i] y [i]to[/i] inclusive. [i]from[/i] y [i]to[/i] pueden ser números negativos.
fr: Générer un nombre entier signé de 32 bits aléatoire entre [i]de[/i] et [i]à[/i] inclusivement. [i]de[/i] et [i]à[/i] peuvent être des nombres négatifs ou positifs
pl: Generuj losową znakowaną 32-bitową liczbę całkowitą pomiędzy [i]od[/i], a [i]do[/i], włącznie. [i]od[/i] oraz [i]do[/i] może być liczbą ujemną albo dodatnią.

source: random integer number between {from: INT} and {to: INT}
de: Zufällige Ganzzahl zwischen {from: INT}und {to: INT}
es: número entero aleatorio entre {from: INT} y {to: INT}
fr: nombre entier aléatoire entre {from: INT} et {to: INT}
pl: losowa liczba całkowita pomiędzy {from: INT}, a {to: INT}

source: Calculate the sine of [i]angle[/i]
de: Berechnet den Sinus von [i]Winkel[/i]
es: Calcula el seno del ángulo [i]angle[/i].
fr: Calculer le sinus de [i]l'angle[/i]
pl: Policz sinus [i]kąta[/i]

source: Calculate the tangent of [i]angle[/i]
de: Berechnet den Tangens von [i]Winkel[/i]
es: Calcula la tangente del ángulo [i]angle[/i].
fr: Calculer la tangente de [i]l'angle[/i]
pl: Policz tanges [i]kąta[/i]

source: Creates a unit Vector2 rotated to the given angle in radians.
de: Erzeugt einen Einheitsvektor (Vector2) gedreht um den angegeben Winkel im Bogenmaß.
es: Crea un Vector2 unitario rotado al ángulo proporcionado en radianes.
fr: Crée un Vector2 unitaire tourné à l'angle donné en radians.
pl: Tworzy jednostkowy Vector2 obrócony o dany kąt w radianach

source: vector from {angle: FLOAT}
de: Einheitsvektor mit Winkel {angle: FLOAT}
es: vector desde {angle: FLOAT}
fr: vecteur depuis {angle: FLOAT}
pl: wektor z {angle: FLOAT}

source: Multiplies a vector with a number. Use this, for example, to get a point some distance away along an angle.
de: Multipliziert einen Vektor mit einer Zahl.
es: Multiplica un vector por un número. Usa esto, por ejemplo, para obtener un punto a cierta distancia a lo largo de un ángulo.
fr: Multiplie un vecteur par un nombre. Utilisez cela, par exemple, pour obtenir un point à une certaine distance le long d'un angle.
pl: Mnoży wektor z liczbą. Użyj tego, na przykład, by dostać jakiś dystans wzdłuż kąta.

source: multiply {vector: VECTOR2} by {number: FLOAT}
de: multipliziere {vector: VECTOR2} mit {number: FLOAT}
es: multiplicar {vector: VECTOR2} por {number: FLOAT}
fr: multiplier {vector: VECTOR2} par {number: FLOAT}
pl: pomnóż {vector: VECTOR2} przez {number: FLOAT}

source: move and slide
de: bewegen und gleiten
es: mover y desplazar
fr: déplacer et glisser
pl: porusz i ślizgaj

source: Sounds
de: Klänge
es: Sonidos
fr: Sons
pl: Dźwięki

source: Play the audio stream
de: Spiele den Audiostream
es: Reproduce la transmisión de audio.
fr: Lire le flux audio
pl: Odtwórz strumień audio

source: play
de: Abspielen
es: reproducir
fr: lire
pl: odtwórz

source: Stop the audio stream
de: Stoppe den Audiostream
es: Detiene la transmisión de audio.
fr: Arrêter le flux audio
pl: Zatrzymaj strumień audio

source: Load a resource file as the audio stream
de: Lade eine Ressourcedatei als Audiostream
es: Carga un archivo de recursos como una transmisión de audio.
fr: Charger un fichier de ressource en tant que flux audio
pl: Wczytaj plik zasobu jako strumień audio

source: load file {file_path: STRING} as sound {name: STRING}
de: Lade Datei {file_path: STRING} als Sound {name: STRING}
es: cargar archivo {file_path: STRING} como sonido {name: STRING}
fr: charger le fichier {file_path: STRING} comme son {name: STRING}
pl: wczytaj plik {file_path: STRING} jako dźwięk {name: STRING}

source: Pause/Continue the audio stream
de: Audiostream pausieren/fortsetzen
es: Pausa/continúa la transmisión de audio.
fr: Mettre en pause/Continuer le flux audio
pl: Zapauzuj/kontynuuj strumień audio

source: {pause: NIL} the sound {name: STRING}
de: {pause: NIL}den Sound {name: STRING}
es: {pause: NIL} el sonido {name: STRING}
fr: {pause: NIL} le son {name: STRING}
pl: {pause: NIL} dźwięk {name: STRING}

source: Play the audio stream with volume and pitch
de: Den Audiostream abspielen mit Lautstärke und veränderter Tonhöhe
es: Reproduce la transmisión de audio con el volumen y tono proporcionados.
fr: Lire le flux audio avec le volume et la hauteur
pl: Odtwórz strumień audio z głośnością i wysokością

source: play the sound {name: STRING} | with volume {db: FLOAT} dB and pitch scale {pitch: FLOAT}
de: Den Sound {name: STRING} abspielen | mit Lautstärke {db: FLOAT}dB und Tonhöhenfaktor {pitch: FLOAT}
es: reproducir el sonido {name: STRING} | con volumen {db: FLOAT} dB y escala de tono {pitch: FLOAT}
fr: lire le son {name: STRING} | avec un volume de {db: FLOAT} dB et une hauteur de {pitch: FLOAT}
pl: odtwórz dźwięk {name: STRING} | z głośnością {db: FLOAT} dB i skalą wysokości {pitch: FLOAT}

source: stop the sound {name: STRING}
de: Stoppe den Sound {name: STRING}
es: detener el sonido {name: STRING}
fr: arrêter le son {name: STRING}
pl: zatrzymaj dźwięk {name: STRING}
