Repository: endlessm/godot-block-coding
Catalog: addons/block_code/locale/*.po
Languages: de, es, fr, pl

source: Lifecycle | Spawn
de: Lebensdauer | Partikel erzeugen
es: Ciclo de vida | Aparecer
fr: Cycle de vie | Génération
pl: Cykl działania | Przyzywanie

source: Emitted when all active particles have finished processing.
de: Gesendet wenn alle aktiven Partikel verarbeitet worden sind.
es: Emitido cuando todas las partículas activas han terminado de procesar.
fr: Émis lorsque toutes les particules actives ont terminé leur traitement.
pl: Emitowany, kiedy wszystkie cząsteczki skończyły się przetwarzać.

source: when particles are finished
de: Wenn alle Partikel beendet
es: cuando las partículas terminan
fr: quand les particules sont terminées
pl: kiedy cząsteczki są zakończone

source: Transform | Position
de: Umwandeln | Position
es: Transformación | Posición
fr: Transformation | Position
pl: Transformacja | Pozycja

source: set physics position {position: VECTOR2}
de: Setze Physik-Position auf {position: VECTOR2}
es: establecer posición física en {position: VECTOR2}
fr: définir la position physique {position: VECTOR2}
pl: ustaw pozycję fizyki {position: VECTOR2}

source: UI
de: Benutzeroberfläche (UI)
es: Interfaz de usuario
fr: Interface utilisateur

source: Set the text for the label.
de: Setzt den Text für dieses Label.
es: Establece el texto de la etiqueta.
fr: Définir le texte de l'étiquette.
pl: Ustaw tekst dla etykiety.

source: set text to {text: STRING}
de: Setze Text auf {text: STRING}
es: establecer texto en {text: STRING}
fr: définir le texte sur {text: STRING}
pl: ustaw text na {text: STRING}

source: vector2 x: {x: FLOAT} y: {y: FLOAT}
fr: vecteur2 x : {x: FLOAT} y : {y: FLOAT}

source: Set the %s property
es: Establece la propiedad %s
fr: Définir la propriété %s

source: set %%s to {value: %s}
es: establecer %%s en {value: %s}
fr: définir %%s sur {value: %s}

source: Change the %s property
es: Cambia la propiedad %s
fr: Changer la propriété %s

source: change %%s by {value: %s}
es: cambiar %%s por {value: %s}
fr: changer %%s de {value: %s}

source: The %s property
es: La propiedad %s
fr: La propriété %s

source: Set the %s variable
es: Establece la variable %s
fr: Définir la variable %s

source: set %s to {value: %s}
es: establecer %s en {value: %s}
fr: définir %s sur {value: %s}

source: The %s variable
es: La variable %s
fr: La variable %s

source: Open Block Script
de: Blockskript öffnen
es: Abrir script de bloques
fr: Ouvrir le script par blocs
pl: Otwórz Skrypt Blokowy

source: move with {player: NIL} buttons as {kind: NIL}
es: mover con botones {player: NIL} como {kind: NIL}
fr: se déplacer avec les boutons {player: NIL} comme {kind: NIL}

source: Move the character using the “Player 1” or “Player 2” controls as configured in Godot. “Top-down” enables the character to move in both x (horizontal) and y (vertical) dimensions, as if the camera is above the character, looking down. No gravity is added. “Platformer” enables the character to move as if the camera is looking from the side, like a side-scroller. Gravity is applied on the y (vertical) axis, making the character fall down until they collide with something. “Spaceship” uses the left/right controls to rotate the character and up/down controls to go forward or backward in the direction they are pointing.
es: Mueve al personaje usando los controles de “Player 1” o “Player 2” como están configurados en Godot. “Top-down” hace que el personaje se mueva en ambas dimensiones x (horizontal) e y (vertical), como si la cámara estuviera sobre el personaje, apuntando hacia abajo. No se agrega gravedad. “Platformer” hace que el personaje se mueva como si la cámara estuviera apuntando de costado, como un side-scroller. Se aplica gravedad en el eje y (vertical), dejando al personaje caer hacia abajo hasta que colisiona con algo. “Spaceship” utiliza los controles izquierda/derecha para rotar al personaje y arriba/abajo para moverlo hacia adelante o atrás en la dirección que está apuntando.
fr: Déplacer le personnage en utilisant les commandes « Joueur 1 » ou « Joueur 2 » telles que configurées dans Godot. « Vue de dessus » permet au personnage de se déplacer à la fois dans les dimensions x (horizontale) et y (verticale), comme si la caméra était au-dessus du personnage, regardant vers le bas. Aucune gravité n'est ajoutée. « Plateformes » permet au personnage de se déplacer comme si la caméra regardait de côté, comme un jeu de défilement horizontal. La gravité est appliquée sur l'axe y (vertical), faisant tomber le personnage jusqu'à ce qu'il entre en collision avec quelque chose. « Vaisseau spatial » utilise les commandes gauche/droite pour faire pivoter le personnage et les commandes haut/bas pour avancer ou reculer dans la direction qu'il pointe.

source: game over {result: STRING}
fr: fin de partie {result: STRING}

source: Show the game over label with the win or lose message.
es: Muestra el cartel de "game over" con un mensaje de ganar o perder.
fr: Afficher l'étiquette de fin de partie avec le message de victoire ou de défaite.

source: reset game over
es: reiniciar game over
fr: réinitialiser la fin de partie

source: Reset the game over label.
es: Reinicia el cartel de "game over".
fr: Réinitialiser l'étiquette de fin de partie.

source: set score to {score: INT}
es: establecer puntaje en {score: INT}
fr: définir le score sur {score: INT}

source: change score by {score: INT}
es: cambiar el puntaje por {score: INT}
fr: changer le score de {score: INT}

source: spawn once
es: spawnear una vez
fr: générer une fois

source: start spawning
es: comenzar spawneo
fr: commencer à générer

source: stop spawning
es: detener spawneo
fr: arrêter de générer

source: is spawning
es: está spawneando
fr: est en cours de génération

source: set spawn period to {new_period: FLOAT}
es: establecer período de spawneo en {new_period: FLOAT}
fr: définir la période de génération sur {new_period: FLOAT}

source: spawn period
es: período de spawneo
fr: période de génération

source: Advanced
es: Avanzado
fr: Avancé

source: Show Generated Script
de: Generiertes Skript anzeigen
es: Mostrar el script generado
fr: Afficher le script généré
pl: Pokaż wygenerowany skrypt

source: Delete Block Code
de: Blockcode löschen
es: Borrar código de bloques
fr: Supprimer le code par blocs
pl: Usuń Kod Blokowy

source: Toggle Block Picker (Ctrl+BackSlash)
de: Block-Auswahlwerkzeug an/aus (Strg+ß)
es: Alternar paleta de bloques (Ctrl + barra invertida)
fr: Afficher/Masquer le sélecteur de blocs (Ctrl+Backslash)
pl: Przełącz pobieracz bloków (Ctrl+BackSlash)

source: Select a node to create and edit block code.
de: Wähle einen Node, um Blöcke zu erzeugen oder zu bearbeiten.
es: Selecciona un nodo para crear y editar un código de bloques.
fr: Sélectionnez un nœud pour créer et modifier du code par blocs.
pl: Wybierz węzeł, by utworzyć i edytować kod blokowy.

source: Use block coding to create custom behavior and game mechanics for "{node}".
de: Benutze Block-Programmierung, damit sich "{node}" wie gewünscht verhält.
es: Utiliza el código de bloques para crear un comporamiento particular y mecánicas de juego para "{node}".
fr: Utilisez le codage par blocs pour créer un comportement et des mécanismes de jeu personnalisés pour « {node} ».
pl: Użyj kodowania blokowego, by utworzyć własne zachowanie i mechaniki dla "{node}".

source: Add Block Code
de: Blockcode hinzufügen
es: Agregar código de bloques
fr: Ajouter du code par blocs
pl: Dodaj Kod Blokowy

source: "{node}" uses block coding.
de: "{node}" benutzt Block-Programmierung.
es: "{node}" usa código de bloques.
fr: « {node} » utilise le codage par blocs.
pl: "{node}" używa kodowania blokowego.

source: Open in Editor
de: Im Editor öffnen
es: Abrir en editor
fr: Ouvrir dans l'éditeur
pl: Otwórz w edytorze

source: Override Block Code
de: Blockcode überschreiben
es: Sobreescribir código de bloques
fr: Remplacer le code par blocs
pl: Nadpisz Kod Blokowy

source: Duplicate
es: Duplicar
fr: Dupliquer

source: Delete
es: Borrar
fr: Supprimer

source: Parameter
es: Parámetro
fr: Paramètre
pl: Parametr

source: Example
de: Beispiel
es: Ejemplo
fr: Exemple
pl: Przykład

source: Create New Variable
de: Neue Variable erstellen
es: Crear variable nueva
fr: Créer une nouvelle variable
pl: Utwórz nową zmienną

source: Create
de: Erstellen
es: Crear
fr: Créer
pl: Utwórz

source: Name
es: Nombre
fr: Nom
pl: Nazwa

source: Block Code Generated GDScript
de: GDScript aus Block-Programmierung
es: GDScript generado desde el código de bloques
fr: GDScript généré par le code par blocs
pl: Wygenerowany GDScript z Kodu Blokowego

source: Copy
de: Kopieren
es: Copiar
fr: Copier
pl: Kopiuj

source: The coordinates of the mouse position.
es: Las coordenadas de la posición del mouse.
fr: Les coordonnées de la position de la souris.

source: mouse position
es: posición del mouse
fr: position de la souris

source: Gives the x or y of a [b]Vector2[/b]
es: Establece el x o y de un [b]Vector2[/b]
fr: Donne le x ou le y d'un [b]Vector2[/b]

source: {xy: NIL} of {vector2: VECTOR2}
de: {xy: NIL} von {vector2: VECTOR2}
es: {xy: NIL} de {vector2: VECTOR2}
fr: {xy: NIL} de {vector2: VECTOR2}
pl: {xy: NIL} z {vector2: VECTOR2}

source: Gives the x, y, or z of a [b]Vector3[/b]
es: Establece el x, y, o z de un [b]Vector3[/b]
fr: Donne le x, le y ou le z d'un [b]Vector3[/b]

source: {xyz: NIL} of {vector3: VECTOR3}
de: {xyz: NIL} von {vector3: VECTOR3}
es: {xyz: NIL} de {vector3: VECTOR3}
fr: {xyz: NIL} de {vector3: VECTOR3}
pl: {xyz: NIL} z {vector3: VECTOR3}

source: Multiplies a Vector3 with a number. Use this, for example, to get a point some distance away along an angle.
es: Multiplica un Vector3 por un número. Usa esto, por ejemplo, para obtener un punto a lo largo de un ángulo.
fr: Multiplie un Vector3 par un nombre. Utilisez cela, par exemple, pour obtenir un point à une certaine distance le long d'un angle.

source: multiply {vector: VECTOR3} by {number: FLOAT}
de: multipliziere {vector: VECTOR3} mit {number: FLOAT}
es: multiplicar {vector: VECTOR3} por {number: FLOAT}
fr: multiplier {vector: VECTOR3} par {number: FLOAT}
pl: pomnóż {vector: VECTOR3} przez {number: FLOAT}

source: Stop playing the current scene, and switch to a different one. You might use this to switch to a new level.
es: Deja de reproducir la escena actual, y cambia a otra escena. Podrías usar esto para cambiar a un nuevo nivel.
fr: Arrêter la scène actuelle et passer à une autre. Vous pouvez l'utiliser pour passer à un nouveau niveau.

source: switch the scene to {file_path: STRING}
es: cambiar la escena a {file_path: STRING}
fr: passer la scène à {file_path: STRING}

source: vector3 x: {x: FLOAT} y: {y: FLOAT}: z: {z: FLOAT}
fr: vecteur3 x : {x: FLOAT} y : {y: FLOAT} z : {z: FLOAT}

source: Attached blocks will be executed before each physics step
es: Los bloques conectados serán ejecutados durante el paso de procesamiento de física
fr: Les blocs attachés seront exécutés avant chaque étape de la physique

source: every physics step
es: en cada paso de física
fr: à chaque étape de la physique

source: cos {angle: FLOAT}
es: coseno {angle: FLOAT}

source: sin {angle: FLOAT}
es: seno {angle: FLOAT}

source: tan {angle: FLOAT}
es: tangente {angle: FLOAT}

source: Type:
de: Typ:
es: Tipo:
pl: Typ:

source: Type
de: Typ
es: Tipo
pl: Typ
